from collections import deque
N = int(input())
lv = [int(input()) for _ in range(N)]
cnt = 0

for i in range(N-1,0,-1):
    if lv[i] <= lv[i-1]:
        while lv[i] <= lv[i-1]:
            lv[i-1] -= 1
            cnt += 1
print(cnt)

개발에 집중 -> X


(싸피에서 하는거만 따라 갈 경우)
노 헬스케어 쌩 개발자 --> 경쟁력 좆도 없음


# (임상경력 n년 보유)
(따로 공부해야함) - 닷넷, SQL, C#, 자바
유 헬스케어 + 개발자 --> 무기 갖춤(경쟁력 소폭 상승)


(원래 가능)
개발할 줄 아는 간호사 --> 어썸


--> 그래도 3교대지만 4500주는 대병 간호사
연락오면 깔끔하게 포기 가능?

이 결정을 쳐내려면
기회비용 3330

싸피 있어야할 이유 (수료전까지)
싸피수료했다는 경력이 혹시라도 나중에 도움이 될수도있으니까
공부 분야다름
집중도 안됨
메리트 :


3교대
1일 12시간
출퇴근 왕복 1시간
13시간 일당
1년에 2500시간
2000시간 공부했다 1년동안~

카아오 뭐시기 입사
5000

개발 상 간호경력 하 경쟁력x
개발 중 간호경력 중
개발 하 간호경력 상

개발 상 간호경력 상

개발 하 간호경력 하



앞으로 노인인구 개많음

젊은이 없어짐

현재 상급종합병원 돌아가는 구조
-> 간호사 갈갈이 -> 근본 시스템 바꿔야함
입사 세 달안에 70~80% 나감
1년에 만2천명 가량 생산됨


대한간호협회
-> 4년제
-> 간호대 편입 -> 타과에서 3학년으로 편입하는거 인정
사실상 2년제 간호학과의 탄생

그러면 기존 시스템이 안바뀌면
어쨌든 계속 10배럭의 마음으로 마린을 찍어내는것

'얼마나 최 단시간에 그나마 숙련된 신규간호사를 육성시킬 수 있는가'

--> 간호대, 임상병리학과, 치위생
교육에 진보가 이루어져야함
아직까지 정말정말정말 00년대 초반에 머물러 있음

왜?
교수님들 - 다 엄마임 진보 없음 다 자기 연구하기 바쁨
교육시스템이 개선이 안댐

돈이 없음 ㅋㅋ
간호사 입지가 의사에 밀림 ㅋㅋ

간호사

비전 세계 건강
골 모두의 건강 증진
미션 각 국 공동체 설립
전략 외교, 기술교역, 솔루션개발
전술 김땡땡씨 접근해서 외교 다지기, 박땡땡 영입해서 기술개발 등등
계획 1년간 외교 30% 기술70% 분배 성장
일정 한달 일정 등등등


인기 많은 여자 특징

1. 애매하게 예뻐서
= 남자가 넘사벽이라고 느끼지 못하기 때문
= 내가 넘을 수 있을 거 같거든
(흘리는거, 받아주는거는 바로 위에줄을 1스택씩 더 높이는 도구)
=
이미 줏대가 아니라 감정만 남아있는 사람인거 파악했으니까

2. 괜히 아름다운 마무리? 덕담? 이런거 필요 없음
-----> 그거를 일단 정성들여서 만들어
그리고 그거 주고 카톡 메세지 2개로 끝내는거임
개 쿨하게 해야함.
그냥 이제 난 할일 다 했다는 식?
----> 정말 매트하게 가야함:






(사진) <-> 메시지
강사님은 먼저 가셔서 못적었고
안부전해달라고 하시네







# 아 그리고
# 묘가 재귀함수잉ㅁ ㅋ
# 알고리즘 화이팅
#

답장오면?
안읽씹
or 오키오키
or 어 그래~

24시간뒤 체크표시






